app/controllers/meals_controller.rb

SELECT "meals".* FROM "meals"
---
  def index
    @meals = Meal.all

INSERT INTO "meals" ("title", "date_eaten", "meal_type", "calories", "notes", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["title", ""], ["date_eaten", nil], ["meal_type", 0], ["calories", nil], ["notes", ""], ["picture", ""], ["created_at", "2022-10-18 13:16:53.274370"], ["updated_at", "2022-10-18 13:16:53.274370"]]
---
  def create
    @meal = Meal.new(meal_params)

    respond_to do |format|
      if @meal.save

UPDATE "meals" SET "picture" = ?, "updated_at" = ? WHERE "meals"."id" = ?  [["picture", "0dbc3833-3e60-4e1c-88eb-a345251ac65c.jpg"], ["updated_at", "2022-10-18 13:28:38.981331"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @meal.update(meal_params)

DELETE FROM "meals" WHERE "meals"."id" = ?  [["id", 1]]
---
  def destroy
    @meal.destroy

SELECT "meals".* FROM "meals" WHERE "meals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_meal
      @meal = Meal.find(params[:id])